app/views/pages/explore.html.erb


        <a href="/<%= User.find(p.user_id).username %>"><%= image_tag(p.user.avatar.url(:medium), :class => "explore-post-avatar") %></a>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

            <div class="panel-heading post-heading">
                <span class="post-owner"><a href="/<%= User.find(p.user_id).username %>"><%= User.find(p.user_id).name %></a></span>
---
SELECT "posts".* FROM "posts" WHERE (created_at >= '2016-12-25 00:19:51.884406')  ORDER BY "posts"."created_at" DESC