app/views/pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts" WHERE (created_at >= '2016-12-25 00:42:02.133999')  ORDER BY "posts"."created_at" DESC
---
            <div class="col-sm-11">
              <p class="post-title"><span class="post-owner"><a href="/<%= User.find(@p.user_id).username %>"><%= User.find(@p.user_id).name %></a></span> <span class="post-creation">- <%= @p.created_at.to_formatted_s(:short) %></span></p>