app/views/pages/profile.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND (created_at > '2016-12-25 00:42:18.218087')  ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
                        <h2 class="profile_name"><%= user.name %></h2>
                        <h5><span class="label label-default profile_points"><%= user.posts.count %> Floot Points</span></h5>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
                    <%= image_tag(p.user.avatar.url(:thumb), :class => "avatar-post") %>
                    <span class="post-owner"><a href="/<%= User.find(p.user_id).username %>"><%= User.find(p.user_id).name %></a></span>