app/controllers/pages_controller.rb

  def home
    @posts = Post.where('created_at >= :one_days_ago', one_days_ago: Time.now - 16.hours)
---
SELECT "posts".* FROM "posts" WHERE (created_at >= '2016-12-25 00:42:02.133999')  ORDER BY "posts"."created_at" DESC

  def explore
    @posts = Post.where('created_at >= :one_days_ago', one_days_ago: Time.now - 16.hours)
---
SELECT "posts".* FROM "posts" WHERE (created_at >= '2016-12-25 00:19:51.884406')  ORDER BY "posts"."created_at" DESC

  def profile
    if (User.find_by_username(params[:id]))
      @username = params[:id]
      @users = User.all.where("id = ?", User.find_by_username(params[:id]).id)
      @posts = Post.where(user_id: User.find_by_username(params[:id]).id).where('created_at > ?', 16.hours.ago)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "background"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND (created_at > '2016-12-25 00:42:18.218087')  ORDER BY "posts"."created_at" DESC  [["user_id", 1]]