app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # Assign post to the user who created it.
        respond_to do |f|
            if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "This is the first floot posted!"], ["user_id", 1], ["created_at", "2016-12-26 00:43:54.250729"], ["updated_at", "2016-12-26 00:43:54.250729"]]

    def destroy # Allow post owner to delete post
        @post = Post.find(params[:id])
        if current_user == @post.user
            @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY "posts"."created_at" DESC LIMIT 1  [["id", 8]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]